Revit 2024 API
CitySet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual CitySetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As CitySetIterator
Visual C++
public:
virtual CitySetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
CitySet Class
Autodesk.Revit.DB Namespace